// See https://aka.ms/new-console-template for more information
Console.WriteLine("Hello, World!");

/* 18. Создать метод GetArray, который возвращает массив целых чисел и не принимает аргументов. 
Реализовывать метод не нужно, тело должно остаться пустым, но код должен компилироваться. 
В теле метода можно вернуть пустой массив. Метод вызовите в методе Main.*/

class program
{
public static void Main(string[] args)
{
    GetArray();
}

static int GetArray()
{
    return default;
}
}